xml/InformationRegisters/ИИА_Логи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_Логи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Диалог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИИА_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CallId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/ИИА_DialogLog/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СохранитьЛогДиалога(СсылкаДиалога, ТекстЛога) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ПустаяСтрока(ТекстЛога) Тогда
		Возврат;
	КонецЕсли;
	ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LOG_SNAPSHOT] " + ТекстЛога);
КонецПроцедуры

Функция ПолучитьЛогДиалога(СсылкаДиалога) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИА_Логи.Лог КАК Лог
	|ИЗ
	|	РегистрСведений.ИИА_Логи КАК ИИА_Логи
	|ГДЕ
	|	ИИА_Логи.Диалог = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ИИА_Логи.Дата";
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	Части = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Части.Добавить(Выборка.Лог);
	КонецЦикла;
	Возврат СтрСоединить(Части, Символы.ПС);
КонецФункции

Функция ФорматироватьКомпактноДляЛога(Текст) Экспорт
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	ТекстВРег = ВРег(Текст);
	Если СтрНайти(ТекстВРег, "DSL_SYSTEM_RESULT") > 0 Тогда
		Успех = (СтрНайти(ТекстВРег, """SUCCESS"":TRUE") > 0 ИЛИ СтрНайти(ТекстВРег, """SUCCESS"": TRUE") > 0)
			И СтрНайти(ТекстВРег, """SUCCESS"":FALSE") = 0;
		Статус = ?(Успех, "ok", "err");
		ПозОшибки = СтрНайти(ТекстВРег, """ERROR"":");
		Если НЕ Успех И ПозОшибки > 0 Тогда
			Начало = ПозОшибки + 9;
			КонецТекстаОшибки = СтрНайти(Сред(Текст, Начало), """");
			СообщениеОшибки = ?(КонецТекстаОшибки > 0, СтрЗаменить(Сред(Текст, Начало, КонецТекстаОшибки - 1), Символы.ПС, " "), "");
			Возврат "DSL Result: " + Статус + " | " + Лев(СообщениеОшибки, 120);
		КонецЕсли;
		ПозAction = СтрНайти(ТекстВРег, """ACTION"":");
		ПозMessage = СтрНайти(ТекстВРег, """MESSAGE"":");
		Действие = "";
		Сообщение = "";
		Если ПозAction > 0 Тогда
			ПослеКолонки = Сред(Текст, ПозAction + 9);
			ПозОткр = СтрНайти(ПослеКолонки, """");
			Если ПозОткр > 0 Тогда
				Внутри = Сред(ПослеКолонки, ПозОткр + 1);
				ПозЗакр = СтрНайти(Внутри, """");
				Если ПозЗакр > 0 Тогда
					Действие = Сред(Внутри, 1, ПозЗакр - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ПозMessage > 0 Тогда
			ПослеКолонки = Сред(Текст, ПозMessage + 10);
			ПозОткр = СтрНайти(ПослеКолонки, """");
			Если ПозОткр > 0 Тогда
				Внутри = Сред(ПослеКолонки, ПозОткр + 1);
				ПозЗакр = СтрНайти(Внутри, """");
				Если ПозЗакр > 0 Тогда
					Сообщение = СтрЗаменить(Сред(Внутри, 1, ПозЗакр - 1), Символы.ПС, " ");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЛимитСообщения = ?(Действие = "GetMetadata" ИЛИ Действие = "GetObjectFields", 600, 80);
		Возврат "DSL Result: " + Статус + " | " + Действие + ": " + Лев(Сообщение, ЛимитСообщения);
	КонецЕсли;
	Если СтрНайти(ТекстВРег, """DSL_VERSION""") > 0 И СтрНайти(ТекстВРег, """STEPS""") > 0 Тогда
		ПозAction = СтрНайти(ТекстВРег, """ACTION"":");
		ПозQuery = СтрНайти(ТекстВРег, """QUERY"":");
		Действие = "";
		Запрос = "";
		Если ПозAction > 0 Тогда
			ПослеКолонки = Сред(Текст, ПозAction + 9);
			ПозОткр = СтрНайти(ПослеКолонки, """");
			Если ПозОткр > 0 Тогда
				Внутри = Сред(ПослеКолонки, ПозОткр + 1);
				ПозЗакр = СтрНайти(Внутри, """");
				Если ПозЗакр > 0 Тогда
					Действие = Сред(Внутри, 1, ПозЗакр - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ПозQuery > 0 Тогда
			ПослеКолонки = Сред(Текст, ПозQuery + 8);
			ПозОткр = СтрНайти(ПослеКолонки, """");
			Если ПозОткр > 0 Тогда
				Внутри = Сред(ПослеКолонки, ПозОткр + 1);
				ПозЗакр = СтрНайти(Внутри, """");
				Если ПозЗакр > 0 Тогда
					Запрос = СтрЗаменить(Сред(Внутри, 1, ПозЗакр - 1), Символы.ПС, " ");
					Запрос = Лев(Запрос, 100);
					Если СтрДлина(Запрос) = 100 Тогда
						Запрос = Запрос + "...";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Возврат "DSL: " + Действие + ?(ПустаяСтрока(Запрос), "", " | " + Запрос);
	КонецЕсли;
	Обрезанный = СокрЛП(Текст);
	Если СтрДлина(Обрезанный) > 2 И Лев(Обрезанный, 1) = "["
		И (СтрНайти(ТекстВРег, """ЗАДАЧА""") > 0 ИЛИ СтрНайти(ТекстВРег, """ВЫПОЛНЕНА""") > 0) Тогда
		Возврат "[ПЛАН] " + СжатьJSONВСтроку(Текст);
	КонецЕсли;
	ОбычныйТекст = СокрЛП(Текст);
	Если СтрДлина(ОбычныйТекст) > 1600 Тогда
		ОбычныйТекст = Лев(ОбычныйТекст, 1600) + "...(truncated)";
	КонецЕсли;
	Возврат ОбычныйТекст;
КонецФункции

Функция СжатьJSONВСтроку(Текст) Экспорт
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	Результат = СтрЗаменить(Текст, Символы.ПС, " ");
	Результат = СтрЗаменить(Результат, Символы.ВК, " ");
	Результат = СтрЗаменить(Результат, Символы.ВТаб, " ");
	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");
	КонецЦикла;
	Возврат СокрЛП(Результат);
КонецФункции

Процедура ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьЛога, Роль = "", CallId = "", УИДЗаписи = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если СсылкаДиалога = Неопределено
		ИЛИ ТипЗнч(СсылкаДиалога) <> Тип("СправочникСсылка.ИИА_Диалоги")
		ИЛИ СсылкаДиалога.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЗаписьЛога) Тогда
		Возврат;
	КонецЕсли;
	Если СтрНайти(ЗаписьЛога, "dsl_system_result") > 0 Тогда
		СодержимоеПоследнее = ПолучитьСодержимоеПоследнейЗаписиЛога(СсылкаДиалога);
		Если СтрНайти(СодержимоеПоследнее, "dsl_system_result") > 0 Тогда
			КлючНовый = ИзвлечьКлючевоеСодержимоеДляСравнения(ЗаписьЛога);
			КлючПоследний = ИзвлечьКлючевоеСодержимоеДляСравнения(СодержимоеПоследнее);
			Если НЕ ПустаяСтрока(КлючНовый) И КлючНовый = КлючПоследний Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(Роль) Тогда
		Роль = ИзвлечьРольИзТекстаЛога(ЗаписьЛога);
	КонецЕсли;
	Роль = Лев(Роль, 50);
	ТекстЗаписи = УбратьПрефиксРолиИзТекстаЛога(ЗаписьЛога, Роль);
	Если CallId <> Неопределено Тогда
		CallId = Лев(Строка(CallId), 36);
	Иначе
		CallId = "";
	КонецЕсли;
	Если НЕ ПустаяСтрока(УИДЗаписи) Тогда
		УИДЗаписи = Лев(Строка(УИДЗаписи), 36);
	Иначе
		УИДЗаписи = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	Попытка
		МенеджерЗаписи = РегистрыСведений.ИИА_Логи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Диалог = СсылкаДиалога;
		МенеджерЗаписи.УИД = УИДЗаписи;
		МенеджерЗаписи.Роль = Роль;
		МенеджерЗаписи.CallId = CallId;
		МенеджерЗаписи.Дата = ТекущаяДата();
		МенеджерЗаписи.Лог = ТекстЗаписи;
		МенеджерЗаписи.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	Попытка
		ДиалогОбъект = СсылкаДиалога.ПолучитьОбъект();
		ПараметрыПользователя = ИИА_Сервер.ПолучитьНастройкиПользователя(ДиалогОбъект.Пользователь);
		Если ПараметрыПользователя <> Неопределено
			И ПараметрыПользователя.Свойство("РежимОтладки") И ПараметрыПользователя.РежимОтладки
			И ПараметрыПользователя.Свойство("ПутьКЛогуОтладки") И ЗначениеЗаполнено(ПараметрыПользователя.ПутьКЛогуОтладки) Тогда
			ЗаписьТекста = Новый ЗаписьТекста(ПараметрыПользователя.ПутьКЛогуОтладки, КодировкаТекста.UTF8, Символы.ПС, Истина);
			ЗаписьТекста.ЗаписатьСтроку(ТекстЗаписи);
			ЗаписьТекста.Закрыть();
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

Процедура ОчиститьФайлЛогаОтладки(СсылкаДиалога) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ДиалогОбъект = СсылкаДиалога.ПолучитьОбъект();
		ПараметрыПользователя = ИИА_Сервер.ПолучитьНастройкиПользователя(ДиалогОбъект.Пользователь);
		Если ПараметрыПользователя <> Неопределено
			И ПараметрыПользователя.Свойство("РежимОтладки") И ПараметрыПользователя.РежимОтладки
			И ПараметрыПользователя.Свойство("ПутьКЛогуОтладки") И ЗначениеЗаполнено(ПараметрыПользователя.ПутьКЛогуОтладки) Тогда
			ЗаписьТекста = Новый ЗаписьТекста(ПараметрыПользователя.ПутьКЛогуОтладки, КодировкаТекста.UTF8, Символы.ПС, Ложь);
			ЗаписьТекста.Закрыть();
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция ИзвлечьРольИзТекстаЛога(ТекстЗаписи) Экспорт
	Если ПустаяСтрока(ТекстЗаписи) Тогда
		Возврат "";
	КонецЕсли;
	ПозОткрытия = Найти(ТекстЗаписи, "[");
	Если ПозОткрытия = 0 Тогда
		Возврат "";
	КонецЕсли;
	ПозЗакрытия = Найти(Сред(ТекстЗаписи, ПозОткрытия), "]");
	Если ПозЗакрытия = 0 Тогда
		Возврат "";
	КонецЕсли;
	Роль = Сред(ТекстЗаписи, ПозОткрытия + 1, ПозЗакрытия - 2);
	Возврат Лев(СокрЛП(Роль), 50);
КонецФункции

Функция УбратьПрефиксРолиИзТекстаЛога(ТекстЗаписи, Роль) Экспорт
	Если ПустаяСтрока(ТекстЗаписи) Тогда
		Возврат "";
	КонецЕсли;
	ПозОткрытия = Найти(ТекстЗаписи, "[");
	Если ПозОткрытия <> 1 Тогда
		Возврат ТекстЗаписи;
	КонецЕсли;
	ПозЗакрытия = Найти(Сред(ТекстЗаписи, 2), "]");
	Если ПозЗакрытия = 0 Тогда
		Возврат ТекстЗаписи;
	КонецЕсли;
	ПозКонецСкобки = 1 + ПозЗакрытия;
	Остаток = СокрЛП(Сред(ТекстЗаписи, ПозКонецСкобки + 1));
	Если СтрНачинаетсяС(Остаток, " ") Тогда
		Остаток = СокрЛП(Сред(Остаток, 2));
	КонецЕсли;
	Возврат Остаток;
КонецФункции

Функция ПолучитьСодержимоеПоследнейЗаписиЛога(СсылкаДиалога) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИИА_Логи.Лог КАК Лог
	|ИЗ
	|	РегистрСведений.ИИА_Логи КАК ИИА_Логи
	|ГДЕ
	|	ИИА_Логи.Диалог = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ИИА_Логи.Дата УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЛогСтрока = Выборка.Лог;
	Поз = Найти(ЛогСтрока, "] ");
	Если Поз > 0 Тогда
		Возврат СокрЛП(Сред(ЛогСтрока, Поз + 2));
	КонецЕсли;
	Возврат ЛогСтрока;
КонецФункции

Функция ИзвлечьКлючевоеСодержимоеДляСравнения(ТекстЗаписи) Экспорт
	ПозНачала = СтрНайти(ТекстЗаписи, "{");
	ПозКонца = СтрНайти(ТекстЗаписи, Символы.ПС + "---");
	Если ПозНачала = 0 Тогда
		Возврат СокрЛП(ТекстЗаписи);
	КонецЕсли;
	Если ПозКонца = 0 Тогда
		ПозКонца = СтрДлина(ТекстЗаписи) + 1;
	КонецЕсли;
	Ключ = Сред(ТекстЗаписи, ПозНачала, ПозКонца - ПозНачала);
	Возврат СокрЛП(Ключ);
КонецФункции

#КонецОбласти
#КонецОбласти
